# Вычислить число pi c заданной точностью d. Метод Монте-Карло
# Отношение вероятностей площадей круга к квадрату равно отношению их вероятностей
# Sкруг/Sкв = (pi*R^2)/(2*R^2) = pi/4

print("Введите точность вычисления (количетство точек после запятой)")
d = int(input())

from random import random

times = 10000000
hits = 0
for i in range(times):     # Цикл
    x = random()           # Генерация случайных чисел
    y = random()
    if x * x + y * y <= 1: # Если сгенерированные значения удовлетворяют уравнению единичной окружности
        hits += 1
print(4.0 * hits/times)